tutorials/halfSphere/ChemicalEquilibriumMach10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       14230;
    }
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       14230;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       14310;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       14400;
    }
    wedgefront
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          7200;
        startFace       14480;
    }
    wedgeback
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          7200;
        startFace       21680;
    }
)

// ************************************************************************* //
